In [55]:
import pandas as pd
import numpy as np

In [56]:
df1 = pd.DataFrame(np.random.randint(0,5,size=(10, 1)), columns=list('A')) # random 1 column df
df2 = pd.DataFrame(np.random.randint(0,5,size=(10, 1)), columns=list('B')) # random 1 column df
df2["new"] = df2.apply(lambda row: 1 if row[0] == df1["A"][row.name] else 0, axis = 1) # lambda function to check if they match. row.name gets the index

In [20]:
df1

   A
0  0
1  0
2  3
3  2
4  3
5  1
6  1
7  2
8  0
9  0

In [21]:
df2

   B  new
0  1    0
1  4    0
2  0    0
3  0    0
4  1    0
5  4    0
6  1    1
7  2    1
8  3    0
9  0    1

In [10]:
df2['B'][96]

4

In [12]:
[[4, 9]] * 3

[[4, 9], [4, 9], [4, 9]]

In [17]:
df2.loc[95]['B']

4

In [73]:
df1= pd.DataFrame({'A':[1,2,3,4,5],'B':[5,8,1,2,10],'Year':[2014,2015,2014,2014,2014]})
df1

   A   B  Year
0  1   5  2014
1  2   8  2015
2  3   1  2014
3  4   2  2014
4  5  10  2014

In [74]:
df2 = pd.DataFrame({'A':[9,1,4,2,3,7],'D':['X','Y','Z','K','L','G'],'Year':[2014,2014,2014,2014,2014,2014]})

In [75]:
df2

   A  D  Year
0  9  X  2014
1  1  Y  2014
2  4  Z  2014
3  2  K  2014
4  3  L  2014
5  7  G  2014

In [79]:
df3 = pd.merge(df1,df2,on=['A','Year'])

In [80]:
df3

   A  B  Year  D
0  1  5  2014  Y
1  3  1  2014  L
2  4  2  2014  Z

In [81]:
df4 = pd.merge(df1,df2,on=['A'])

In [82]:
df4

   A  B  Year_x  D  Year_y
0  1  5    2014  Y    2014
1  2  8    2015  K    2014
2  3  1    2014  L    2014
3  4  2    2014  Z    2014

In [46]:
df1["new"] = df1.apply(lambda row: df2["D"][row.name], axis = 1) # lambda function to check if they match. row.name gets the inde

In [47]:
df1

   A   B new
0  1   5   X
1  2   8   Y
2  3   1   Z
3  4   2   K
4  5  10   L

In [49]:
df2.set_index('C')

   D
C
9  X
1  Y
4  Z
2  K
3  L
7  G
5  F

In [50]:
df1["new"] = df1.apply(lambda row: df2.loc(row['A'],'D'), axis = 1)

TypeError: ('__call__() takes from 1 to 2 positional arguments but 3 were given', 'occurred at index 0')

In [35]:
df2.loc[3,'D']

'K'

In [52]:
d = dict(df1)

In [53]:
d

{'A': 0    1
 1    2
 2    3
 3    4
 4    5
 Name: A, dtype: int64, 'B': 0     5
 1     8
 2     1
 3     2
 4    10
 Name: B, dtype: int64, 'new': 0    X
 1    Y
 2    Z
 3    K
 4    L
 Name: new, dtype: object}

In [54]:
df1

   A   B new
0  1   5   X
1  2   8   Y
2  3   1   Z
3  4   2   K
4  5  10   L

In [83]:
df3

   A  B  Year  D
0  1  5  2014  Y
1  3  1  2014  L
2  4  2  2014  Z

In [84]:
a = set()
a.add(5)

In [85]:
a

{5}

In [86]:
a.add(5)

In [87]:
a

{5}

In [88]:
a.add(15)

In [89]:
a

{5, 15}

In [90]:
len(a)

2

In [92]:
for item in a:
    print(item)

5
15

In [93]:
a = {}
a['i'] = 5
a['she'] = 10
a

{'i': 5, 'she': 10}

In [97]:
import numpy
a = 4
np.sqrt(a)

2.0